<template>
	<view class="">
		<pre>
小程序用户使用协议

欢迎您使用 【智航者】 小程序（以下简称“本小程序”）。在使用本小程序之前，请您仔细阅读并理解本《用户使用协议》（以下简称“本协议”）。当您注册、登录或使用本小程序服务时，即表示您已阅读、理解并同意接受本协议的全部内容。

如果您不同意本协议的任何条款，请停止使用本小程序。

一、服务内容

本小程序由 【智航者科技】（以下简称“我们”）开发并运营。

本小程序为用户提供包括但不限于以下服务：

信息展示服务

设备管理服务

数据查询服务

其他相关功能服务

我们有权根据业务发展需要，对本小程序的服务内容进行增加、减少或调整。

二、用户注册与账户

用户在使用本小程序部分功能时，可能需要进行授权登录或注册账户。

用户应保证所提供的信息真实、准确、完整。

用户应妥善保管自己的账户信息，因账户泄露造成的损失由用户自行承担。

用户不得将账户借给他人使用，否则由此产生的责任由用户自行承担。

三、用户行为规范

用户在使用本小程序时，不得进行以下行为：

发布违法、违规或不良信息；

侵犯他人合法权益；

利用本小程序从事非法活动；

破坏本小程序系统安全或正常运行；

进行任何未经授权的数据抓取、接口调用或恶意攻击行为。

如发现用户存在上述行为，我们有权采取包括但不限于以下措施：

限制功能使用

暂停或终止服务

追究法律责任

四、用户数据与隐私保护

我们非常重视用户隐私保护，并将按照相关法律法规保护用户个人信息。

在提供服务过程中，我们可能会收集以下信息：

用户基本信息（如昵称、头像等）

设备信息

使用记录

我们不会在未经用户同意的情况下向第三方提供用户个人信息，但以下情况除外：

法律法规要求

司法机关或政府部门要求

为维护公共利益或用户权益

详细内容请参阅《隐私政策》。

五、知识产权

本小程序的所有内容，包括但不限于：

软件程序

界面设计

图片

文档

数据

均受法律保护，其知识产权归 【公司名称/开发者】 所有。

未经许可，任何单位或个人不得复制、传播或用于商业用途。

六、服务变更、中断或终止

在以下情况下，我们有权暂停或终止部分或全部服务：

系统维护或升级；

不可抗力因素（如网络故障、自然灾害等）；

用户违反本协议；

法律法规要求。

对于因上述原因导致的服务中断，我们将尽量提前通知，但不承担由此产生的损失。

七、免责声明

本小程序按“现状”提供服务，不保证服务不会中断或没有错误。

因用户自身操作不当或设备问题导致的损失，我们不承担责任。

因网络环境、第三方服务等原因造成的服务异常，我们不承担责任。

八、协议修改

我们有权根据业务发展或法律法规要求，对本协议进行修改。修改后的协议将在本小程序内公布，公布后即生效。

如用户继续使用本小程序服务，即视为接受修改后的协议。

九、法律适用与争议解决

本协议适用 中华人民共和国法律。

因本协议产生的争议，双方应友好协商解决；协商不成的，提交 【公司所在地人民法院】 解决。

十、联系方式

如您对本协议或本小程序服务有任何疑问，可以通过以下方式联系我们：

开发者名称：南通市龙源水产科技有限公司

联系电话：13906270309

协议生效日期： 【2026年01月01日】


小程序隐私政策

更新日期：【2026年01月01日】
生效日期：【2026年01月01日】

欢迎您使用 【智航者】（以下简称“本小程序”）。
我们非常重视您的个人信息和隐私保护。本《隐私政策》旨在说明我们如何收集、使用、存储和保护您的个人信息。

请您在使用本小程序前仔细阅读本隐私政策。当您开始使用本小程序服务时，即表示您已充分理解并同意本隐私政策。

一、我们收集的信息

在您使用本小程序服务过程中，我们可能会收集以下信息：

1. 您主动提供的信息

当您使用相关功能时，您可能需要提供：

微信昵称

微信头像

联系方式（如手机号）

您主动填写的其他信息

这些信息用于为您提供正常的小程序服务。

2. 系统自动收集的信息

在您使用小程序过程中，我们可能会自动收集部分信息，例如：

设备信息（设备型号、操作系统版本）

网络信息（IP地址、网络类型）

小程序使用日志

这些信息用于：

提升服务稳定性

优化用户体验

防止系统安全风险

二、我们如何使用您的信息

我们收集的信息将用于以下用途：

提供小程序基础服务

实现设备管理或业务功能

改进产品体验

保障系统安全

响应用户请求或问题反馈

遵守法律法规要求

我们不会将您的个人信息用于未说明的用途。

三、信息共享与披露

我们承诺不会向任何第三方出售您的个人信息。

但在以下情况下，我们可能会共享或披露您的信息：

获得您的明确授权

根据法律法规要求

根据司法机关或行政机关要求

为维护公共利益或重大合法权益

为提供服务所必要的第三方技术支持（如云服务）

在涉及第三方服务时，我们会要求其遵守相关隐私保护规定。

四、信息存储与保护

我们会采取合理的技术措施保护您的个人信息，包括但不限于：

数据加密

权限控制

安全审计

防止数据泄露

您的个人信息将存储在 中华人民共和国境内服务器。

在实现服务目的所需的期限内保存您的信息，超过期限后将删除或匿名化处理。

五、您的权利

根据相关法律法规，您对自己的个人信息享有以下权利：

查询您的个人信息

更正您的个人信息

删除您的个人信息

撤回授权

如果您希望行使上述权利，可以通过本隐私政策中的联系方式与我们联系。

六、未成年人保护

如果您是 未满18周岁的未成年人，请在监护人的指导下阅读本隐私政策，并在取得监护人同意后使用本小程序。

七、隐私政策更新

我们可能会根据法律法规或业务变化，对本隐私政策进行更新。

更新后的隐私政策将在小程序内发布，并注明更新时间。
如果您继续使用本小程序服务，即表示您同意更新后的隐私政策。

八、联系我们

如果您对本隐私政策有任何疑问、意见或建议，可以通过以下方式联系我们：

开发者名称：【智航者科技】
联系电话：【15161515197】
		</pre>
	</view>
</template>

<script setup>
</script>

<style>
</style>